Repository: 84000/translation-memory-resources
Catalog: post_input/toh101.bo.en.tmx
Source language: bo
Languages: en

source: བདེ་ བ་ མ་ མཆིས་ ཤིང་ སྡུག་བསྔལ་ མ་ མཆིས་ ལགས་ ཏེ །_
en: there is neither happiness nor suffering.

source: དེ་དག་ ཐམས་ཅད་ ནི་ རློམ་སེམས་ ལགས་ ཤིང་ །_ དེ་དག་ ཐམས་ཅད་ ནི་ གཡོ་བ་ ལགས་ པ འི་ སླད་ དུའོ །_།
en: Because all that is thought, all that is conceptual movement.

source: བཅོམ་ལྡན་འདས་ དེ་བཞིན་ཉིད་ རྗེས་སུ་ ཐོབ་པ་ དང་ །_ རྗེས་སུ་ མ་ ཐོབ་པ འི་ སླད་ དུ་ དེ་བཞིན་ གཤེགས་ པ་ ནི་ དེ་བཞིན་ གཤེགས་པ་ ཞེས་ བགྱི་བ འི་ གྲངས་ སུ་ མཆི་བ་ མ་ ལགས་ ཏེ །_
en: $102 “Blessed One, whether someone qualifies for the title of ‘thus-gone one’ is not to be decided in terms of whether or not suchness has been attained.

source: འདི་ལྟར་ དེ་དག་ ཐམས་ཅད་ ནི་ གཡོ་བ་ དང་ །_ རློམ་སེམས་ དང་ །_ གཡོས་པ་ དང་ །_ སྤྲོས་པ་ ལགས་པ འི་ སླད་ དུའོ །_།
en: All that is conceptual movement, thought, straying, and construction.

source: དེ་བཞིན་ གཤེགས་པ ས་ ནི་ བདེན་པ འམ །_ བརྫུན་པ འམ །_ འདུས་ བྱས་ སམ །_ འདུས་མ་བྱས་ སམ །_ ཟག་པ་ དང་ བཅས་པ་ འམ །_ ཟག་པ་ མ་ མཆིས་པ འམ །_ ཁ་ན་མ་ཐོ་བ་ དང་ བཅས་པ འམ །_ ཁ་ན་མ་ཐོ་ བ་མ་ མཆིས་པ འམ །_ འཇིག་རྟེན་པ འམ །_ འཇིག་རྟེན་ ལས་ འདས་པ འམ །_ ཚུལ་ཁྲིམས་ སམ །_ འཆལ་པ འི་ ཚུལ་ཁྲིམས་ སམ །_ སྟོབས་ རྣམས་ སམ །_ སྟོབས་ མ་ མཆིས་པ འམ །_ མི་ འཇིགས་པ འམ །_ མི་ འཇིགས་པ་ མ་ མཆིས་པ འམ །_ སྦྱིན་གནས་ སམ །_ སྦྱིན་གནས་ མ་ ལགས་པ་ འམ །_ དེ་བཞིན་ གཤེགས་པ འམ །_ སངས་རྒྱས་ སམ །_ བྱང་ཆུབ་ སེམས་དཔའ་ འམ །_ ཉན་ཐོས་ སམ །_ རང་ སངས་རྒྱས་ སམ །_ སྨོན་ལམ་ རྣམས་ སམ །_ བྱིན་ གྱི་ རླབས་ རྣམས་ ཀྱི་ རློམ་སེམས་ ཐམས་ཅད་ ཡང་དག་ པར་ བཅོམ་ ཞིང་ ལམ་ ཡོངས་སུ་ མཁྱེན་ ཏེ
en: Truth and falsity, the conditioned and the unconditioned, the defiled and the undefiled, negativity and lack of negativity, the mundane and the supramundane, being disciplined and having flawed discipline, having powers and not having powers, being fearless and not being fearless, being worthy of donations and not being worthy of donations, being a thus-gone one, being a buddha, being a bodhisattva, being a hearer, being a solitary buddha, as well as prayers, and blessings—all such thinking is completely crushed by the thus-gone ones and the path is comprehended completely.

source: དེ་བས་ན་ དེ་བཞིན་ གཤེགས་པ་ ནི་ བག་ཚ་བ་ མི་ མངའ་བ ར་ སེང་གེ་ ལྟ་བུ་ དང་ །_ གླང་ པོ་ཆེ་ ལྟ་བུ འི་ སྒྲ་ སྒྲོགས་ པར་ མཛད་ ལགས་སོ །_།
en: That is why the thus-gone ones are undaunted like lions. |#| That is why they trumpet like elephants.

source: དེ་བཞིན་ གཤེགས་པ་ ནི་ བཞེད་ ན་ |#| མི་ འཐུན་པ་ རྣམས་ ལ་ མི་ འཐུན་པ འི་ འདུ་ཤེས་ ཅན་ དུ་ གནས་པ ར་ མཛད །_ |#| འཐུན་པ་ རྣམས་ ལ་ འཐུན་པ འི་ འདུ་ཤེས་ ཅན་ དུ་ གནས་པ ར་ མཛད་ དོ །_།
en: When they make their assertions, the thus-gone ones let there be disagreement where there is disagreement and agreement where there is agreement.

source: དེ་བཞིན་ གཤེགས་པ་ ནི་ བཞེད་ ན་ [19b] དྲན་པ་ དང་ ལྡན་ ཞིང་ མཁྱེན་ བཞིན་ དུ་ དེ་ གཉི་ག ས་ ཀྱང་ བཏང་སྙོམས་ པར་ གནས་པ ར་ མཛད་ དོ །_།
en: The thus-gone ones make their assertions [19.b] with mindfulness and wisdom, and with both dwell in equanimity.

source: བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ འི་ གནས་པ་ དེ་དག་ ནི་ སངས་རྒྱས་ ཀྱི་ གནས་པ་ དག་ དང་ །_ རང་བྱུང་ གི་ གནས་པ་ དག་ དང་ །_ ཉན་ཐོས་ དང་ །_ རང་ སངས་ རྒྱས་ རྣམས་ དང་ །_ ཡང་ ཐུན་མོང་ མ་ ལགས་པ འི་ གནས་པ་ དག་ ལགས་ ན །_ |#| དེ་དག་ ལས་ གཞན་པ འི་ སེམས་ཅན་ ཐ་ཆད་ རྣམས་ དང་ ཐུན་མོང་ མ་ ལགས་པ་ ལྟ་ སྨོས་ ཀྱང་ ཅི་ འཚལ །_
en: $103 “The states of the blessed thus-gone ones are states of awakening and states that are self-arisen. |#| Since they are not even shared by hearers or solitary buddhas, they are of course not common to other lowly beings.

source: བཅོམ་ལྡན་འདས་ ཅིའི་སླད་དུ་ ཐུན་མོང་ མ་ ལགས་ ཤེ་ན །_
en: And why, Blessed One, are they not shared with others?

source: དེ་ལས་ གཞན་ པ འི་ སེམས་ཅན་ ཐ་ཆད་ ཀྱིས་ དེ་ལྟ་ བུ འི་ གནས་པ་ དེ་དག་ དང་ །_ དེ་སྙེད་ ཀྱི་ གནས་པ་ དེ་དག་ དང་ །_ ཡུན་ ཇི་སྲིད་ ནས་ གནས་པ་ དེ་དག་ དང་ །_ སྦྱོར་བ་ དེ་ལྟ་ བུ འི་ གནས་པ་ དེ་དག་ དང་ །_ བདེ་བ་ དེ་ལྟ་ བུ འི་ གནས་པ་ དེ་དག་ འཚལ་བ ར་ རྔོ་ མི་ ཐོག་ ཅིང་ །_ བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ དང་ བྲལ་བ འི་ སེམས་ཅན་ རྣམས་ ཀྱི་ གནས་ དེ་དག་ འཚལ་བ ར་ རྔོ་ མི་ ཐོག་པ འི་ སླད་ དུའོ །_།
en: Because all other lowly beings cannot achieve states that are of that quality, or that are so comprehensive, or that are of the same duration, or with the same application, or that involve such bliss. |#| Blessed One, without the thus-gone ones, no sentient being can achieve such states.

source: བཅོམ་ལྡན་འདས་ དེ་དག་ ནི་ སེམས་ཅན་ གཞན་དག་ གི་ སྤྱོད་ཡུལ་ མ་ ལགས་ ཤིང་ །_ དེ་བཞིན་ གཤེགས་པ འི་ གནས་པ་ དེ་ལྟ་ བུ་ དེ་དག་ ནི་ ཉན་ཐོས་ དང་ རང་ སངས་རྒྱས་ ཐམས་ཅད་ ཀྱི་ སྤྱོད་ཡུལ་ མ་ ལགས་ ཏེ །_
en: Blessed One, such states are not accessible to any other being. |#| Blessed One, states of this kind are not accessible to any hearer or solitary buddha.

source: བཅོམ་ལྡན་འདས་ སྤྱོད་ཡུལ་ མ་ ལགས་ ཞེས་ བགྱི་བ་ ནི་ སྤྱོད་པ་ མ་ མཆིས་ ཤིང་ །_ རྣམ་པར་ སྤྱོད་པ་ མ་ མཆིས་པ་ སྟེ །_
en: Blessed One, ‘not accessible’ here means that they are not effectuated or experienced.

source: དེས་ན་ སྤྱོད་ཡུལ་ མ་ ལགས་ ཞེས་ བགྱི འོ །_།
en: Hence they are inaccessible.

source: བཅོམ་ལྡན་འདས་ དེ་ ལ་ ཉན་ཐོས་ དག་ གམ །_ རང་ སངས་རྒྱས་ དག་ གི་ སྤྱོད་པ་ མ་ མཆིས་པ འི་ སླད་ དུའོ །_།
en: Because such states surpass the experience of hearers and solitary buddhas.

source: བཅོམ་ལྡན་འདས་ གནས་པ་ དེ་ མཐའ་ཡས་པ འི་ སླད་ དུའོ །_།
en: Because, Blessed One, such states are infinite.

source: བཅོམ་ལྡན་འདས་ ཅིའི་སླད་དུ་ གནས་པ་ མཐའ་ཡས་པ་ ལགས་ ཤེ་ན །_
en: And why, Blessed One, are such states infinite?

source: བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ དག་ གི་ མོས་པ་ ནི་ མཐའ་ ཡ ས་ ཏེ །_
en: Because, Blessed One, the wishes of the thus-gone ones are infinite;

source: གང་ གིས་ ཀྱང་ འཚལ་བ ར་ རྔོ་ མི་ ཐོག་ ལགས་སོ །_།
en: they cannot be matched by anything at all.

source: བཅོམ་ལྡན་འདས་ གནས་པ་ དེ་ ནི་ ཡི་གེ་ མ་ མཆིས་པ་ ལགས་ ཏེ །_
en: Because, Blessed One, such states are beyond language.

source: ཡི་གེ་ མ་ མཆིས་པ་ ཞེས་ བགྱི་བ་ ནི་ བརྗོད་ དུ་མ་ མཆིས་པ་ ལགས་ ལ །_
en: Being ‘beyond language’ is to be inexpressible, and [20.a]

source: ཡི་གེ་ [20a] ནི་ བརྗོད་པ་ ཁོ་ན་ ལགས་ པས་ དེ འི་ སླད་ དུ་ བཅོམ་ལྡན་འདས་ དེ་ ནི་ རང་བྱུང་ གི་ གནས་པ་ མ་ ལགས་སོ །_།
en: language is nothing but expression. |#| Therefore, Blessed One, these states are self-arisen.

source: བཅོམ་ལྡན་འདས་ གང་དག་ གནས་པ་ དེ་ ལ་ རྣམ་པར་ ལྟ་བ ར་ མི་ འགྱུར་ ཞིང་ རབ་ཏུ་ འཚལ་བ ར་ མི་འགྱུར་བ འི་ སེམས་ཅན་ དེ་དག་ འཇིག་རྟེན་ གྱི་ ཁམས་ གཞན་ ནས་ ཤི་འཕོས་པ་ ལགས་སོ །_།
en: $104 “Blessed One, beings who do not observe such states and do not understand them must go through death and transfer to other world realms.

source: གང་དག་ གནས་པ་ དེ་ གློ་བ ར་ ཆུད་པ ར་ མི་འགྱུར་བ་ དེ་དག་ གིས་ ནི་ གནོད་པ་ ཆེན་པོ་ དང་ ལྡན་པ ར་ འཚལ་བ ར་ བགྱི འོ །_།
en: Beings who do not comprehend such states come to suffer great harm.

source: བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ འི་ གནས་པ་ དེ་ ནི་ བཅོམ་ལྡན་འདས་ དོན་ གྱི་ སྒོ་ དང་ །_ ཆོས་ ཀྱི་ སྒོ་ དེ་ ལགས་ ཏེ །_
en: $105 “Blessed One, the state of the thus-gone ones is the ultimate gateway, the gateway of the Dharma.

source: འཁོར་ སྒོ་ དྲུག་ ཁྲི་ བརྒྱད་ སྟོང་ དང་ ལྡན་པ་ ལགས་སོ །_།
en: It contains sixty-eight thousand subsidiary gateways.

source: དེ་བཞིན་ གཤེགས་པ་ རིན་པོ་ཆེ འི་ བཀོད་པ་ གཅིག་པ འི་ བྱང་ཆུབ་ ནི་ ནམ་མཁའ་ ལྟ་བུ ར་ ཚད་མ་ མཆིས་ ཤིང་ །_ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ དེ་དག་ སྒོ་ གཅིག་པ འི་ ཚད་ ལས་ རྗེས་སུ་ ཐོབ་པ་ ལགས་སོ །_།
en: The awakening of the thus-gone Single Jewel Ornament is limitless like space and the bodhisattva great beings gain accomplishment through the extent of the very same gateway.”

source: སྒོ འི་ ཚིག་ འདི་ བསྟན་ ཅིང་ བཤད་པ་ ན་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ བདུན་ ཁྲི་ བདུན་ སྟོང་ གིས་ ནི་ སྒྲིབ་པ་ མེད་པ འི་ ཆོས་ ཀྱི་ སྒོ་ རྗེས་སུ་ ཐོབ་ སྟེ |#| འདི་ལྟ་སྟེ །_ དེ་བཞིན་ གཤེགས་པ འི་ གནས་པ་ དེ་ཉིད་ དོ །_།
en: $106 When this gateway teaching was delivered and explained, seventy-seven thousand bodhisattva great beings attained the gateway of the stainless Dharma, which is the very state of the thus-gone ones.

source: དེ་དག་ ཐམས་ཅད་ ཀྱིས་ བདག་ཅག་ གིས་ དེང་ བྱང་ཆུབ་ ཐོབ་པོ །_། བདག་ཅག་ གིས་ དེང་ བྱང་ཆུབ་ ཐོབ་པོ་ ཞེས་ བྱ་བ འི་ ཚིག་ ཀྱང་ སྨྲས་ སོ །_།
en: They all thus declared, “Today we have attained awakening! |#| Today we have attained awakening!”

source: སྲོག་ཆགས་ བྱེ་བ་ ཁྲག་ཁྲིག་ ཕྲག་ དྲུག་ཅུ་ ནི་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ སེམས་སྐྱེས་ ཏེ །_
en: $107 Furthermore, one quadrillion beings set their minds on unexcelled and perfect awakening, and

source: བཅོམ་ལྡན་འདས་ ཀྱིས་ དེ་དག་ སེམས་ དང་པོ་ བསྐྱེད་པ་ ཉིད་ ཀྱིས་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏོ །_།
en: because of their initial generation of the mind of awakening the Blessed One prophesied their attainment of unexcelled and perfect awakening.

source: སྲོག་ཆགས་ བྱེ་བ་ ཁྲག་ཁྲིག་ ས་ཡ་ ཕྲག་ བརྒྱད་ ནི་ ཆོས་ རྣམས་ ལ་ ཆོས་ ཀྱི་ མིག་ རྡུལ་མེད་ ཅིང་ དྲི་མ་ དང་ བྲལ་བ་ སྐྱེས་ སོ །_།
en: Likewise, eight sextillion beings attained the stainless and immaculate Dharma eye that sees phenomena, and

source: དགེ་སློང་ སུམ་ སྟོང་ ནི་ ལེན་པ་ མེད་པར་ ཟག་པ་ རྣམས་ ལས་ སེམས་ རྣམ་པར་ གྲོལ་ ལོ །_།
en: three thousand monks liberated their minds from defilement with no further perpetuation.

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱིས་ དེ འི་ ཚེ་ འཛུམ་པ་ མཛད་ དེ །_
en: $108 At this point the Blessed One smiled, and

source: བཅོམ་ལྡན་འདས་ ཀྱིས་ འཛུམ་པ་ མཛད་ ནས་ |#| ཀྱང་ །_ དེ་ནས་ དེ་ མ་ ཐག་ ཏུ་ དེ འི་ ཚེ་ འཇིག་རྟེན་ དུ་ འོད་ ཆེན་པོ་ བྱུང་བ ར་ གྱུར་ ཅིང་ །_ ས་ ཆེན་པོ་ ཡང་ གཡོས་པ ར་ གྱུར་ ཏོ །_།
en: as soon as he did so a magnificent light shone forth in the world and the great earth shook.

source: དེ་ནས་ ཚེ་ དང་ ལྡན་པ་ ཀུན་དགའ་ བོས་ ཆོས་ [20b] གོས་ ཕྲག་པ་ གཅིག་ ཏུ་ གཟར་ ནས །_ |#| པུས་མོ་ གཡས་པ འི་ ལྷ་ང་ ས་ ལ་ བཙུགས་ ཏེ །_
en: The venerable Ānanda [20.b] now draped his Dharma robe over one shoulder and knelt on his right knee.

source: བཅོམ་ལྡན་འདས་ ག་ལ་བ་ དེར་ ལོགས་ སུ་ ཐལ་མོ་ སྦྱར་བ་ བཏུད་ ནས །_ |#| བཅོམ་ལྡན་འདས་ ལ་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: Joining his palms, he bowed toward the Blessed One and inquired,

source: བཅོམ་ལྡན་འདས་ འཛུམ་པ་ མཛད་པ་ དང་ །_ འཇིག་ རྟེན་ དུ་ སྣང་བ་ ཆེན་པོ་ བྱུང་བ་ དང་ །_ འཇིག་རྟེན་ དུ་ ས་ ཆེན་པོ་ གཡོས་པ འི་ རྒྱུ་ ནི་ གང་ ལགས །_ རྐྱེན་ ནི་ གང་ ལགས །_
en: “When the Blessed One smiled, a magnificent light shone in the world and the great earth shook. |#| What were the causes and conditions for this to happen?”

source: བཅོམ་ལྡན་འདས་ ཀྱིས་ བཀའ་ སྩལ་པ །_
en: the Blessed One replied,

source: ཀུན་དགའ་བོ་ བྱང་ཆུབ་ སེམས་དཔའ་ དྲ་བ་ ཅན་ གྱི་ འོད་ ཀྱིས་ ཆོས་ ཀྱི་ སྒོ་ དེ་ བསྟན་ ཅིང་ བཤད་པ་ ན །_
en: $109 “Ānanda,” |#| “when the bodhisattva Jālinīprabha taught and explained this gateway of the Dharma,

source: བྱང་ ཆུབ་ སེམས་དཔའ་ བདུན་ ཁྲི་ བདུན་ སྟོང་ གིས་ སྒྲིབ་པ་ མེད་པ འི་ ཆོས་ ཀྱི་ ཕྱག་རྒྱ འི་ སྒོ་ ཐོབ་པ ར་ གྱུར་ ཅིང་ །_
en: seventy-seven thousand bodhisattvas attained the gateway of the stainless Dharma seal.

source: ཀུན་དགའ་བོ་ བྱང་ཆུབ་ སེམས་དཔའ་ དྲ་བ་ ཅན་ གྱི་ འོད་ ཀྱིས་ ཆོས་ ཀྱི་ སྒོ འི་ ཚིག་ བསྟན་པ་ དེ་ ནི་ ནམ་མཁ ས་ ཡོངས་སུ་ ཟིན་པ འི་ ས་ཕྱོགས་ དེ་ཉིད་ དུ་ སངས་རྒྱས་ བརྒྱད་ སྟོང་ ལས་ བླངས་ ཏེ
en: Ānanda, the bodhisattva Jālinīprabha has obtained this teaching of the Dharma seal from eight thousand buddhas at locations throughout the expanse of space.

source: བླངས་ ནས་ |#| ཀྱང་ དེ འི་ རྗེས་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ དྲ་བ་ ཅན་ གྱི་ འོད་ སྒྲིབ་པ་ མེད་པ འི་ ཆོས་ ཀྱི་ སྒོས་ ངེས་པ ར་ བྱུང་བ་ དང་ སངས་རྒྱས་ ཀྱི་ ཞིང་ ནས་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དུ་ འགྲོ་བ་ ལ་ མཁས་པ ར་ གྱུར་པ འི་ ཕྱིར་ རོ །_།
en: Having thus obtained this stainless Dharma gateway, he has gained deliverance by means of it, and so he has become skilled in journeying from buddha realm to buddha realm.”

source: ཡང་ དེ འི་ ཚེ་ ཤར་ཕྱོགས་ སུ་ སངས་རྒྱས་ ཀྱི་ ཞིང་ གྲངས་མེད་པ་ བདུན་ཅུ་ རྩ་ བརྒྱད་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རིན་པོ་ཆེ་ བརྩེགས་པ་ གཅིག་པ་ ན །_ |#| དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ རིན་ཆེན་ མཐའ་ ཡ ས་ ཁྱུ་མཆོག་ ཅེས་བྱ་བ་ ད་ལྟ ར་ བཞུགས་ ཏེ་
en: $110 At that time, beyond seventy-eight innumerable buddha realms to the west, there was a world known as Single Heap of Jewels. |#| Within that universe resided a thus-gone one, a worthy one, a perfect buddha known as Infinite Jewel Leader.

source: འཚོ་ ཞིང་ གཞེས་ ལ་ འཁོར་ འབུམ་ ཕྲག་ དུ་མ་ ལ་ ཆོས་ ཀྱང་ སྟོན་ ཏོ །_།
en: Abiding and remaining present there, he taught the Dharma to a retinue of many hundreds of thousands.

source: བཅོམ་ལྡན་འདས་ དེ འི་ རྒྱལ་ཚབ་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ དོན་ཡོད་ ཁྱུ་མཆོག་ རྣམ་པར་ གནོན་ ཅེས་བྱ་བ་ དེ་ འཁོར་ དེར་ འདུས་པ ར་ གྱུར་ ཏེ་ འདུག་ ནས །_
en: Present in that gathering was also the regent of the blessed one Infinite Jewel Leader, the bodhisattva great being Purposeful Compelling Leader.

source: དེས་ གསུང་ བསལ་བ འི་ སྒྲ་ དེ་ ཐོས་ ཏེ །_ |#| དེ་བཞིན་ གཤེགས་ པ ར་ ཤཱཀྱ་ ཐུབ་པ འི་ འོད་ དེ་ཡང་ མཐོང་ ནས་ དེ་བཞིན་ གཤེགས་པ་ རིན་ཆེན་ མཐའ་ ཡ ས་ ཁྱུ་མཆོག་ ལ་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: $111 Hearing a clear voice, and perceiving the light from the thus-gone Śākyamuni, the bodhisattva great being Purposeful Compelling Leader asked the thus-gone Infinite Jewel Leader,

source: བཅོམ་ལྡན་འདས་ གསུང་ བསལ་བ འི་ སྒྲ་ དང་ འོད་ གདའ་བ་ དེ་ སུ འི་ ལགས །_
en: “Blessed One, whose is this clear voice, and whose is this radiance?”

source: དེ་ནས་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་ [21a] པ འི་ སངས་རྒྱས་ རིན་ཆེན་ མཐའ་ ཡ ས་ ཁྱུ་མཆོག་ གིས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ དོན་ཡོད་ ཁྱུ་མཆོག་ རྣམ་པར་ གནོན་ དེ་ |#| ལ་ བཀའ་ སྩལ་པ །_
en: $112 Then the thus-gone one, the worthy one, the perfect [21.a] buddha Infinite Jewel Leader said to the bodhisattva great being Purposeful Compelling Leader,

source: དོན་ཡོད་ ཁྱུ་མཆོག་ རྣམ་པར་ གནོན་ ནུབ་ཕྱོགས་ སུ་ སངས་རྒྱས་ ཀྱི་ ཞིང་ འདི་ ནས་ སངས་རྒྱས་ ཀྱི་ ཞིང་ གྲངས་མེད་པ་ བདུན་ཅུ་ རྩ་ བརྒྱད་ འདས་པ་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ ཅེས་བྱ་བ་ ཡོད་ དེ
en: “Purposeful Compelling Leader, to the west, beyond seventy-eight innumerable universes, there is a world known as Enduring.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ ཤཱཀྱ་ ཐུབ་པ་ ཞེས་ བྱ་བ་ ད་ལྟ ར་ བཞུགས་ ཏེ་
en: Within that universe resides a thus-gone one, a worthy one, a perfect buddha known as Śākyamuni.

source: འཚོ་ ཞིང་ གཞེས་ ལ །_ འདི་ལྟ་སྟེ །_ |#| སེམས་པ་ དཔེ་མེད་པ འི་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ལས་ བརྩམས་ ནས་
en: Abiding and remaining present there, he is now teaching a gathering headed by incomparable bodhisattvas.

source: བྱང་ཆུབ་ སེམས་དཔ འི་ སྡེ་སྣོད་ སེམས་ཅན་ ཐམས་ཅད་ ཡང་དག་ པར་ ཚིམ་པ ར་ བྱེད་པ །_ སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ ཐེ་ཚོམ་ གཅོད་པ་ ཞེས་ བྱ་བ འི་ ཆོས་ ཀྱི་ རྣམ་ གྲངས་ ཀྱི་ ཆོས་ ཀྱང་ སྟོན་ ཏོ །_།
en: He is delivering a Dharma teaching belonging to the Bodhisattva Collection that satisfies all beings and is known as ‘Cutting through the Doubts of All Beings.’

source: དེ་ནས་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ རིན་ཆེན་ མཐའ་ ཡ ས་ ཁྱུ་མཆོག་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ དོན་ཡོད་ ཁྱུ་མཆོག་ རྣམ་པར་ གནོན་ གྱིས་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: $113 At this point the bodhisattva great being Purposeful Compelling Leader said to the thus-gone one, the worthy one, the perfect buddha Infinite Jewel Leader,

source: བཅོམ་ལྡན་འདས་ བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ ཤཱཀྱ་ ཐུབ་པ་ ལ་ བལྟ་བ་ དང་ །_ ཕྱག་ བགྱི་བ་ དང་ །_ བསྙེན་བཀུར་ བགྱི་བ་ དང་ །_ སེམས་པ་ དཔེ་མེད་པ འི་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ དག་ བལྟ་བ འི་ སླད་ དུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ དེར་ བདག་ མཆི་བ ར་ བགྱི འོ །_།
en: “Blessed One, I wish to go to the world known as Enduring, so that I may see, venerate, and serve the blessed thus-gone Śākyamuni, and so that I may see those incomparable bodhisattvas.”

source: བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ རིན་ཆེན་ མཐའ་ ཡ ས་ ཁྱུ་མཆོག་ གིས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ དོན་ཡོད་ ཁྱུ་མཆོག་ རྣམ་པར་ གནོན་ ལ་ འདི་སྐད་ ཅེས་ བཀའ་ སྩལ་ ཏོ །_།
en: replied the blessed thus-gone Infinite Jewel Leader,

source: རིགས་ ཀྱི་ བུ་ ཁྱོད་ དེ འི་ དུས་ ལ་ད་ བབ་པ ར་ ཤེས་ ན་ |#| རིགས་ ཀྱི་ བུ་ ཁྱོད་ སོང་ ལ་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དེར་ ཤེས་བཞིན་ དུ་ གནས་པ ར་ ཡང་ བྱོས་ ཤིག _།
en: $114 “Noble son,” |#| “if you know that the time has come, then go. |#| But act with mindfulness as you remain in that buddha realm.

source: དོན་ཡོད་ ཁྱུ་མཆོག་ རྣམ་པར་ གནོན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ དེར་ སྐྱེས་པ འི་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ གང་དག་ སྐྱེས་པ་ དེ་དག་ བསྙེན་པ ར་ [21b] དཀའ་བ འི་ ཕྱིར་ རོ །_།
en: Because, Purposeful Compelling Leader, the bodhisattva great beings born in that world are hard to approach. [21.b]

source: ང འི་ ཚིག་ གིས་ གནོད་པ་ ཆུང་ ངམ །_ ཉམ་ང་བ་ ཉུང་ ངམ །_ བསྐྱོད་པ་ ཡང་ ངམ །_ སྟོབས་ དང་ བདེ་བ ར་ རེག་པ་ ལ་ གནས་ སམ་ ཞེས་ བསྙུན་ གསོལ་ ལ །_
en: When you arrive, ask on my behalf whether the Blessed One has encountered but little hardship and discomfort, and whether he remains healthy, strong, and at ease.

source: དེ་བཞིན་ གཤེགས་པ་ དེ་ ལ་ ལག་པ་ ལྟ་བུ འི་ པད་མ་ འདི་ ཡང་ ཕུལ་ ཅིག _།
en: You must also offer this hand-like lotus flower to the Thus-Gone One.”

source: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ དོན་ཡོད་ ཁྱུ་མཆོག་ རྣམ་པར་ གནོན་ སྟན་ ལས་ ལངས་ ནས །_ |#| བཅོམ་ལྡན་འདས་ དེ འི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ཏེ །_
en: $115 The bodhisattva great being Purposeful Compelling Leader then rose from his seat, and bowed his head to the feet of that blessed one.

source: བསྐོར་བ་ ཡང་ བྱས་ ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ བདུན་ ཁྲི་ བརྒྱད་ སྟོང་ དང་ ལྷན་ཅིག་ ཏུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ དུ་ འོངས་ ཏེ །_
en: After he had also circumambulated that blessed one, he left for the world of Enduring, accompanied by seventy-eight thousand other bodhisattvas.

source: དེ་ འོངས་ ནས་ |#| དེ་ མ་ ཐག་ ཏུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ ན་ མེ་ཏོག་ གི་ ཤིང་ ངམ །_ འབྲས་བུ འི་ ཤིང་ ཇི་སྙེད་ ཡོད་པ་ དེ་དག་ ཐམས་ཅད་ ཀྱིས་ དེ འི་ ཚེ་ དུས་ མ་ཡིན་པ འི་ མེ་ཏོག་ དག་ དང་ །_ དུས་ མ་ཡིན་པ འི་ འབྲས་བུ་ དག་ གཏོར་ ཏོ །_།
en: As soon as they arrived, all the flowering trees and fruit trees in Enduring bore flowers and fruits regardless of the season.

source: མེ་ཏོག་ གི་ ཆར་པ་ ཡང་ བབ་པོ །_། སྤོས་ ཀྱི་ ཆར་པ་ རྣམ་པ་ སྣ་ཚོགས་ དག་ ཀྱང་ བབ་པོ །_།
en: A rain of flowers and scented water fell from the sky, and

source: རོལ་མོ འི་ སྒྲ་ རྣམ་པ་ སྣ་ཚོགས་ དག་ ཀྱང་ གྲག་ གོ །_།
en: numerous musical sounds could be heard.

source: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ དོན་ཡོད་ ཁྱུ་མཆོག་ རྣམ་པར་ གནོན་ རྒྱལ་པོ འི་ ཁབ་ འོད་མ འི་ ཚལ་ བྱ་ ཀ་ ལན་ ད་ ཀ་ གནས་པ་ ག་ལ་བ་ དེར་ སོང་ སྟེ་
en: The bodhisattva great being Purposeful Compelling Leader proceeded to the Kalandaka­nivāpa in the Veṇuvana by Rājagṛha.

source: ཕྱིན་ ནས །_ |#| བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ཏེ །_
en: Arriving there, he bowed his head to the feet of the Blessed One.

source: ལག་པ་ གཉི་ག ས་ བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་ ལ་ བཟུང་ ངོ་ །_།
en: Holding on to the Blessed One’s feet with both hands, and

source: གདོང་ གིས་ ཀྱང་ ཡོངས་སུ་ གཏུགས་ ཏེ །_ |#| ཚིག་ དེ་སྐད་ ཅེས་ ཀྱང་ གསོལ་ ཏོ །_།
en: touching them to his head, he said,

source: བཅོམ་ལྡན་འདས་ བྱང་ཆུབ་ སེམས་དཔའ་ དོན་ཡོད་ ཁྱུ་མཆོག་ རྣམ་པར་ གནོན་ བཅོམ་ལྡན་འདས་ ཀྱི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ལོ །_།
en: “Blessed One, the bodhisattva Purposeful Compelling Leader bows his head to your feet in homage.”

source: བཅོམ་ལྡན་འདས་ ཀྱིས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ དོན་ཡོད་ ཁྱུ་མཆོག་ རྣམ་ པར་ གནོན་ ལ་ འདི་སྐད་ ཅེས་ བཀའ་ སྩལ་ ཏོ །_།
en: replied the Blessed One,

source: དོན་ཡོད་ ཁྱུ་མཆོག་ རྣམ་པར་ གནོན་ བཀུར་སྟི་ བྱས་པ་ དང་ །_ མཆོད་པ་ དང་ །_ རི་མོ་ བྱས་པ ར་ གྱུར་ཅིག _།
en: $116 “Purposeful Compelling Leader,” |#| “you have offered your respect, worship, and veneration.”

source: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ དོན་ཡོད་ ཁྱུ་མཆོག་ རྣམ་པར་ གནོན་ ས་ལས་ ལངས་ [22a] ཏེ་
en: $117 Then the bodhisattva great being Purposeful Compelling Leader stood up [22.a] and,

source: སྤྱན་སྔ ར་ འདུག་ ནས་ བཅོམ་ལྡན་འདས་ ལ་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: standing before the Blessed One, he said,

source: བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ རིན་ཆེན་ མཐའ་ ཡ ས་ ཁྱུ་མཆོག་ བཅོམ་ལྡན་འདས་ ལ་ གནོད་པ་ ཆུང་ ངམ །_ ཉམ་ ང་བ་ ཉུང་ ངམ །_ བསྐྱོད་པ་ ཡང་ ངམ །_ སྟོབས་ དང་ བདེ་བ ར་ རེག་པ་ ལ་ གནས་ སམ །_ ཞེས་ བསྙུན་ གསོལ་ ཞིང་ །_
en: “The blessed one, the thus-gone one, the worthy one, the perfect buddha Infinite Jewel Leader inquires whether the Blessed One may have encountered but little hardship and discomfort, and whether he remains healthy, strong, and at ease.

source: བཅོམ་ལྡན་འདས་ ལ་ བཅོམ་ལྡན་འདས་ ཀྱིས་ ལག་པ་ ལྟ་བུ འི་ པད་མ་ བསྐུར་བ་ ལགས་ ན །_ |#| བཅོམ་ལྡན་འདས་ ཀྱིས་ ཐུགས་ བརྩེ་བ་ ཉེ་བ ར་ བཟུང་ སྟེ །_ |#| བྱང་ཆུབ་ སེམས་དཔའ་ དོན་ཡོད་ ཁྱུ་མཆོག་ རྣམ་པར་ གནོན་ ལས་ བཞེས་ སུ་ གསོལ །_
en: Blessed One, he also sends you a hand-like lotus flower, requesting that out of your great love you accept it from the bodhisattva Purposeful Compelling Leader.”

source: བཅོམ་ལྡན་འདས་ ཀྱིས་ བྱང་ཆུབ་ སེམས་དཔའ་ དོན་ཡོད་ ཁྱུ་མཆོག་ རྣམ་པར་ གནོན་ ལས་ ལག་པ་ ལྟ་བུ འི་ པད་མ་ དེ་ བཞེས་ ཏེ །_ |#| བཞེས་ ནས་ |#| ཀྱང་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ དོན་ཡོད་ ཁྱུ་མཆོག་ རྣམ་པར་ གནོན་ ལ་ བཀའ་ སྩལ་པ །_
en: $118 Having in this way received the hand-like lotus flower from the bodhisattva, the Blessed One inquired,

source: དོན་ཡོད་ ཁྱུ་མཆོག་ རྣམ་པར་ གནོན་ ཅི་ བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ རིན་ཆེན་ མཐའ་ ཡ ས་ ཁྱུ་མཆོག་ གནོད་པ་ ཆུང་ ངམ །_ ཉམ་ང་བ་ ཉུང་ ངམ །_ འགྱུར་བ་ མི་ མངའ་ འམ །_
en: “Purposeful Compelling Leader, has the blessed thus-gone Infinite Jewel Leader encountered but little hardship and discomfort, and does he remain unchanged?”

source: གསོལ་པ །_
en: replied Purposeful Compelling Leader,

source: བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ རིན་ཆེན་ མཐའ་ ཡ ས་ ཁྱུ་མཆོག་ དེ་ གནོད་པ་ ཆུང་ ཞིང་ སྟོབས་ དང་ ལྡན་ ལ་ འགྱུར་བ་ མི་ མངའ་ སྟེ |#| སངས་རྒྱས་ ཀྱི་ ཞིང་ དེ་ ན་ བདེ་བ ར་ རེག་པ་ ལ་ གནས་ ལགས་སོ །_།
en: $119 “Blessed One,” |#| “the blessed thus-gone Infinite Jewel Leader has encountered but little hardship. |#| He is strong and remains unchanged, happily enjoying his buddha realm.”

source: དེ་ནས་ བཅོམ་ལྡན་འདས་ ཀྱིས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ མ་ཕམ་པ་ ལ་ ལག་པ་ ལྟ་བུ འི་ པད་མ་ དེ་ བྱིན་ ནོ །_།
en: $120 Then the Blessed One gave the hand-like lotus flower to the bodhisattva great being Ajita.

source: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ མ་ཕམ་པ ས་ ལག་པ་ ལྟ་བུ འི་ པད་མ་ དེ་ བླངས་ ནས་ |#| ཚིག་གསོལ་པ །_
en: Holding up the lotus, the bodhisattva great being Ajita offered the following prayer:

source: བཅོམ་ལྡན་འདས་ དགེ་བ འི་ རྩ་བ་ འདི ས་ རིགས་ ཀྱི་ བུ་ དང་ །_ རིགས་ ཀྱི་ བུ་མོ་ གང་དག་ བླ་ ན་ |#| མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ སེམས་ སྐྱེད་པ་ དེ་དག་ གི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ ཡོངས་སུ་ དག་པ ར་ གྱུར་ཅིག _།
en: $121 “Blessed One, by this root of virtue, may the buddha realms of all noble sons and daughters who set their minds on unexcelled and perfect awakening be perfectly pure, and

source: སེམས་ཅན་ ཡོངས་སུ་ སྨིན་པ ར་ གྱུར་ཅིག _།
en: may sentient beings gain maturity.

source: བཅོམ་ལྡན་འདས་ སེམས་ཅན་ [22b] ཡོངས་སུ་ མ་ སྨིན་པ་ རྣམས་ ལ་ ཆོས་ བསྟན་པ་ དང་ །_ སེམས་ཅན་ དགེ་བ འི་ རྩ་བ་ མ་ སྐྱེད་པ་ རྣམས་ དང་ །_ དགེ་བ འི་ རྩ་བ་ ཆུང་ངུ་ རྣམས་ དང་ །_ དམན་པ་ ལ་མོ ས་པ་ རྣམས་ ལ་ ཆོས་ བསྟན་པ་ དཀའ་བ འི་ སླད་ དུ་ སྟེ །_
en: Because, Blessed One, [22.b] it is hard to teach the Dharma to beings who are not mature, who have not engendered roots of virtue, who possess lesser roots of virtue, or who are inspired by what is inferior.

source: བཅོམ་ལྡན་འདས་ ལག་པ་ ལྟ་བུ འི་ པད་མ་ འདི་ ལས་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཇི་སྙེད་ མཐོང་བ ར་ འཚལ་བ་ དེ་སྙེད་ ཀྱང་ མཐོང་བ་ དང་ །_ ལག་པ་ ལྟ་བུ འི་ པད་མ་ འདི་ཉིད་ ལས་ བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ རིན་ཆེན་ མཐའ་ ཡ ས་ ཁྱུ་མཆོག་ དེ འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ རིན་པོ་ཆེ འི་ ཕུང་པོ་ ཞེས་ བགྱི་བ་ གང་ ལགས་པ་ དེ་ཡང་ མཐོང་བ་ དང་ །_ འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་ ན་ བྱང་ཆུབ་ སེམས་དཔའ་ གང་དག་ ཐེག་པ་ ལ་ ཡང་དག་ པར་ ཞུགས་པ་ དེ་དག་ ཀྱང་ མཐོང་བ་ དང་ །_ དེ་ ན་ གང་ ཉན་ཐོས་ ཕུན་སུམ་ ཚོགས་པ་ ཕལ་ཆེ ར་ རིག་པ་ གསུམ་ དང་ ལྡན་པ་ དང་ །_ རིག་པ་ དྲུག་ དང་ ལྡན་ པ་ དེ་དག་ ཀྱང་ མཐོང་བ ར་ འགྱུར་བ འི་ སླད་ དུའོ །_།
en: The objective is, Blessed One, for this hand-like lotus flower to enable beings to perceive whichever realm of the world they may wish. |#| The objective is for the flower to enable the perception of the world known as Heap of Jewels , the buddha realm of the blessed thus-gone Infinite Jewel Leader. |#| It is to enable the perception of the bodhisattvas of that world, who have truly entered their vehicle, as well as the perception of the perfect hearers there, who for the most part are endowed with the threefold or sixfold knowledge.
